app/controllers/photos_controller.rb

SELECT `photos`.* FROM `photos`
---
  def index
    @photos = Photo.all

INSERT INTO `photos` (`created_at`, `updated_at`, `user_photo_content_type`, `user_photo_file_name`, `user_photo_file_size`, `user_photo_updated_at`) VALUES ('2013-01-19 19:07:42', '2013-01-19 19:07:42', 'image/jpeg', 'bottom_pic_red_03.jpg', 9851, '2013-01-19 19:07:42')
---
  def create
    @photo = Photo.new(params[:photo])

    if @photo.save